#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
tls_private_key.rsa_key: Refreshing state... [id=b82f08c474da3ac3867bab4915f23c2a2653ba19]
local_file.tfkey: Refreshing state... [id=7c0c732a82739692968e1c48ee30ce17d8d118d2]
aws_vpc.main: Refreshing state... [id=vpc-0f0937681e2a03404]
aws_eip.nat_gateway: Refreshing state... [id=eipalloc-0ed3fe0aa6660aaf7]
data.aws_ami.java-ami: Reading...
aws_key_pair.terraform_key: Refreshing state... [id=terraform_key]
data.aws_ami.java-ami: Read complete after 0s [id=ami-0865556d8d01be1ac]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-09544529ed29bef83]
aws_security_group.elb: Refreshing state... [id=sg-055535bfe143cdce7]
aws_subnet.privatesubnet_2: Refreshing state... [id=subnet-044aeee947e08bce0]
aws_subnet.privatesubnet_1: Refreshing state... [id=subnet-052fb1d6dc8f7ac0a]
aws_subnet.publicsubnet_1: Refreshing state... [id=subnet-0937bfb563428bfe9]
aws_security_group.allow_http: Refreshing state... [id=sg-05be6488e8f968018]
aws_security_group.allow_ssh: Refreshing state... [id=sg-04622f925cc8baa22]
aws_subnet.publicsubnet_2: Refreshing state... [id=subnet-0cdfe3aae56d99be7]
aws_route_table.public_route_table: Refreshing state... [id=rtb-07cb130dbaf445768]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-053b44dbf2b242f0d]
aws_instance.bastion-host: Refreshing state... [id=i-078d8e3b16315751f]
aws_launch_configuration.ec2_config: Refreshing state... [id=terraform-20230125174949224700000001]
aws_elb.elastic-load-balancer: Refreshing state... [id=ELB]
aws_route_table_association.public_route_table_association_1: Refreshing state... [id=rtbassoc-06a5b649bc9f32edc]
aws_route_table_association.public_route_table_association_2: Refreshing state... [id=rtbassoc-018d333edd57297bd]
aws_route_table.private_route_table: Refreshing state... [id=rtb-00a63ca5443541aad]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-0e73ad4d75f927c75]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-03fc774b1c5170a5f]
aws_autoscaling_group.auto_scaling_group: Refreshing state... [id=Auto Scaling Group]
aws_autoscaling_attachment.asg_attachment: Refreshing state... [id=Auto Scaling Group-20230125190130329800000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_attachment will be created
  + resource "aws_autoscaling_attachment" "asg_attachment" {
      + autoscaling_group_name = "Auto Scaling Group"
      + elb                    = "ELB"
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.auto_scaling_group will be updated in-place
  ~ resource "aws_autoscaling_group" "auto_scaling_group" {
        id                        = "Auto Scaling Group"
      ~ launch_configuration      = "terraform-20230125174949224700000001" -> (known after apply)
        name                      = "Auto Scaling Group"
        # (23 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_launch_configuration.ec2_config must be replaced
-/+ resource "aws_launch_configuration" "ec2_config" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:402135063963:launchConfiguration:31b2ca25-e6e1-4859-8af0-5dfe4f79db80:launchConfigurationName/terraform-20230125174949224700000001" -> (known after apply)
      ~ ebs_optimized                    = false -> (known after apply)
      ~ id                               = "terraform-20230125174949224700000001" -> (known after apply)
      ~ image_id                         = "ami-0c816e85cf6f04a56" -> "ami-0865556d8d01be1ac" # forces replacement
      ~ name                             = "terraform-20230125174949224700000001" -> (known after apply)
      ~ name_prefix                      = "terraform-" -> (known after apply)
      - vpc_classic_link_security_groups = [] -> null
        # (6 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # local_file.tfkey will be created
  + resource "local_file" "tfkey" {
      + content              = (sensitive value)
      + directory_permission = "0777"
      + file_permission      = "400"
      + filename             = "tfkey"
      + id                   = (known after apply)
    }

Plan: 3 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ludicsa, Action: `pull_request`*